# Exrtact a single column from a DataFrame
Similar to filtering tool in spreadsheets

### Import Pandas

In [1]:
import pandas as pd

### Read CSV

In [2]:
salaries = pd.read_csv("mls_salaries.csv")

In [3]:
salaries.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

### `position`

In [4]:
#  returns single column: case sensitive
# DOES NOT work on column names with spaces
salaries.position

0        M
1        D
2        M
3        D
4        F
      ...
610      M
611     GK
612      D
613    NaN
614      D
Name: position, Length: 615, dtype: object

### `club`

In [5]:
# returns single column: case sensitive
# DOES NOT work on column names with spaces
salaries.club

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

### `["club"]`

In [6]:
# this method is the best practice
# works with names with spaces
salaries["club"]

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

### Method Chain

In [7]:
### Head# so you can use method chaining you learned for Series
# keep that in mind
salaries["club"].head(3)

0    ATL
1    ATL
2    ATL
Name: club, dtype: object

### `type()`

In [8]:
# to verify the column data type, ues the type object.
type(salaries["club"])

pandas.core.series.Series